03-Res-Latency-hotel-2profile-better/Res-container-set-v1/container_t_10_c_30_frontCore_4_wrkCore_1_R_200/wrk.txt
Running 2m test @ http://128.226.119.92:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 3.843ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.452ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.030ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.183ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 3.775ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.505ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.765ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.782ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.725ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.690ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.60ms    1.98ms   9.20ms   67.64%
    Req/Sec    20.65     41.47   166.00     77.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.34ms
 75.000%    4.89ms
 90.000%    6.28ms
 99.000%    9.20ms
 99.900%   13.07ms
 99.990%   18.29ms
 99.999%   22.11ms
100.000%   22.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.591     0.000000            1         1.00
       1.488     0.100000         2194         1.11
       1.705     0.200000         4387         1.25
       2.025     0.300000         6572         1.43
       2.745     0.400000         8767         1.67
       3.337     0.500000        10953         2.00
       3.569     0.550000        12063         2.22
       3.775     0.600000        13141         2.50
       4.021     0.650000        14238         2.86
       4.431     0.700000        15338         3.33
       4.887     0.750000        16426         4.00
       5.091     0.775000        16974         4.44
       5.295     0.800000        17527         5.00
       5.511     0.825000        18079         5.71
       5.727     0.850000        18621         6.67
       5.971     0.875000        19174         8.00
       6.115     0.887500        19440         8.89
       6.283     0.900000        19714        10.00
       6.459     0.912500        19991        11.43
       6.655     0.925000        20261        13.33
       6.895     0.937500        20533        16.00
       7.047     0.943750        20670        17.78
       7.235     0.950000        20806        20.00
       7.419     0.956250        20945        22.86
       7.623     0.962500        21081        26.67
       7.903     0.968750        21219        32.00
       8.031     0.971875        21287        35.56
       8.187     0.975000        21358        40.00
       8.319     0.978125        21422        45.71
       8.503     0.981250        21492        53.33
       8.695     0.984375        21562        64.00
       8.807     0.985938        21594        71.11
       8.943     0.987500        21628        80.00
       9.079     0.989062        21662        91.43
       9.295     0.990625        21696       106.67
       9.503     0.992188        21731       128.00
       9.631     0.992969        21748       142.22
       9.759     0.993750        21765       160.00
       9.991     0.994531        21782       182.86
      10.175     0.995313        21799       213.33
      10.279     0.996094        21818       256.00
      10.359     0.996484        21828       284.44
      10.431     0.996875        21833       320.00
      10.711     0.997266        21843       365.71
      11.095     0.997656        21850       426.67
      11.703     0.998047        21859       512.00
      11.855     0.998242        21863       568.89
      12.071     0.998437        21867       640.00
      12.215     0.998633        21872       731.43
      12.887     0.998828        21876       853.33
      13.119     0.999023        21880      1024.00
      13.503     0.999121        21882      1137.78
      13.703     0.999219        21884      1280.00
      14.039     0.999316        21887      1462.86
      14.295     0.999414        21889      1706.67
      15.407     0.999512        21891      2048.00
      15.503     0.999561        21892      2275.56
      15.551     0.999609        21893      2560.00
      16.231     0.999658        21894      2925.71
      16.415     0.999707        21895      3413.33
      16.671     0.999756        21896      4096.00
      17.295     0.999780        21897      4551.11
      17.295     0.999805        21897      5120.00
      18.079     0.999829        21898      5851.43
      18.079     0.999854        21898      6826.67
      18.287     0.999878        21899      8192.00
      18.287     0.999890        21899      9102.22
      18.287     0.999902        21899     10240.00
      18.959     0.999915        21900     11702.86
      18.959     0.999927        21900     13653.33
      18.959     0.999939        21900     16384.00
      18.959     0.999945        21900     18204.44
      18.959     0.999951        21900     20480.00
      22.111     0.999957        21901     23405.71
      22.111     1.000000        21901          inf
#[Mean    =        3.597, StdDeviation   =        1.981]
#[Max     =       22.096, Total count    =        21901]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23880 requests in 2.00m, 9.91MB read
Requests/sec:    198.98
Transfer/sec:     84.57KB